Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddMapField(System.String,System.Type,System.Type)
Creates a field containing an ordered key-value map in the Schema, with given name and
type of contained values.
Remarks:
The supported types for the keys are Boolean, Byte, Int16, Int32, ElementId,
GUID and String. Floating-point types (Float, Double, XYZ and UV) are not supported
because round-off errors frequently cause numeric instability. Subentities are not
supported because they require a custom comparison operator. The suggested workarounds
are either placing key values into an Array and using array indices for keys, or
just using an Array of subentities.
Natural comparison of contained types is used for sorting.
The supported types for values are the same as for simple fields.
See Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddSimpleField(System.String,System.Type) for details.
Note that a schema may contain a maximum of 256 fields.
fieldName:
The name of the new field.
keyType:
The type of the keys for the new field.
valueType:
The type of the values for the new field.
Returns:
The FieldBuilder object may be used to add more details to the field. Make sure to set
the unit type if the field contains floating-point values.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter fieldName is not acceptable for naming Extensible Storage objects.
-or-
The field type is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The combination of key and value types is not supported.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.AddSimpleField(System.String,System.Type)
Creates a field containing a single value in the Schema, with given name and type.
Remarks:
The supported types are Boolean, Byte, Int16, Int32, Float, Double, ElementId,
GUID, String, XYZ, UV and Entity.
Note that data of type ElementId is not copied to new elements that are created via copy/paste or a linear or radial array.
Note that a schema may contain a maximum of 256 fields.
fieldName:
The name of the new field.
fieldType:
The type of the new field.
Returns:
The FieldBuilder object may be used to add more details to the field. Make sure to set
the unit type if the field contains floating-point values.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The parameter fieldName is not acceptable for naming Extensible Storage objects.
-or-
The field type is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012